In [1]:
import pandas as pd
import numpy as np

In [2]:
surveys = pd.read_csv('StackOverflowDeveloperSurvey2018.csv',usecols=['Country','Gender','OperatingSystem'], low_memory=False)

In [3]:
surveys.Country.is_unique

False

In [4]:
#surveys.Country.unique()
surveys.Country.unique()[:20]

array([' or a similar publisher;Questions & answers on Stack Overflow;"Online developer communities other than Stack Overflow (ex. forums',
       'Moderately dissatisfied', 'Moderately satisfied',
       'The official documentation and/or standards for the technology";A book or e-book from Oâ€™Reilly',
       'Slightly satisfied', '30 or more years', nan,
       'Extremely satisfied', 'Neither satisfied nor dissatisfied',
       ' framework', 'United States', 'Less than a month',
       'Extremely dissatisfied', ' etc.)""', 'Slightly dissatisfied',
       'The official documentation and/or standards for the technology";A college/university computer science or software engineering book;Questions & answers on Stack Overflow;Online developer communities other than Stack Overflow (ex. forums',
       '12-14 years', 'MySQL', '3-5 years', ' CodeChef'], dtype=object)

In [5]:
surveys.Country.nunique()

676

In [6]:
len(surveys.Country.unique())

677

In [7]:
duplicatesKeepFirst = surveys.duplicated(subset="Country")

In [8]:
surveys[~duplicatesKeepFirst].head()

,Country,OperatingSystem,Gender
0,or a similar publisher;Questions & answers on...,3 - 4 times per week,NaN
1,Moderately dissatisfied,NaN,Straight or heterosexual
2,Moderately satisfied,NaN,"NA"";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;..."
3,The official documentation and/or standards fo...,I don't typically exercise,NaN
4,Slightly satisfied,Evidence-based software engineering;Formal sta...,3 - 4 times per week

In [9]:
len(surveys[~duplicatesKeepFirst])

677

In [10]:
surveys.drop_duplicates(subset=['Country', 'OperatingSystem'],inplace=True)

In [11]:
surveys.query("Country == 'Poland'")

      Country         OperatingSystem                 Gender
3088   Poland                 Windows                    NaN
5467   Poland                Disagree    Somewhat interested
19100  Poland       Django;TensorFlow          Over 12 hours
31690  Poland  C#;JavaScript;HTML;CSS  Not at all interested

                   Title  Employees  Profits  Assets
Rank
1                Walmart    2300000  13643.0  198825
2     Berkshire Hathaway     367700  24074.0  620854
3                  Apple     116000  45687.0  321686
4            Exxon Mobil      72700   7840.0  330314
5               McKesson      68000   2258.0   56563

Rank
1      1.0
2      7.0
3     57.0
4     94.0
5    104.5
Name: Employees, dtype: float64

                   Title  Employees  Profits  Assets  RankByEmployee
Rank
1                Walmart    2300000  13643.0  198825             1.0
2     Berkshire Hathaway     367700  24074.0  620854             7.0
3                  Apple     116000  45687.0  321686            57.0
4            Exxon Mobil      72700   7840.0  330314            94.0
5               McKesson      68000   2258.0   56563           104.5

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
1,Walmart,2300000,13643.0,198825,1.0,11.0
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0
3,Apple,116000,45687.0,321686,57.0,1.0
4,Exxon Mobil,72700,7840.0,330314,94.0,27.0
5,McKesson,68000,2258.0,56563,104.5,102.0